JamesBara/DSD-i2_Development/DSD-i2_installer Script/esp32/hardware/esp32/2.0.2/boards.txt
#DSD-i2

dsdi2_esp.name=DSD-i2

dsdi2_esp.vid.0= 0x0483
dsdi2_esp.pid.0= 0x5740

dsdi2_esp.upload.tool=dsd_esp_upload
dsdi2_esp.upload.protocol=dsdi2_esp
dsdi2_esp.upload.maximum_size=1310720
dsdi2_esp.upload.maximum_data_size=327680
dsdi2_esp.upload.flags=
dsdi2_esp.upload.extra_flags=
dsdi2_esp.upload.use_1200bps_touch=false
dsdi2_esp.upload.wait_for_upload_port=false

dsdi2_esp.serial.disableDTR=false
dsdi2_esp.serial.disableRTS=false

dsdi2_esp.build.tarch=riscv32
dsdi2_esp.build.target=esp
dsdi2_esp.build.mcu=esp32c3
dsdi2_esp.build.core=esp32
dsdi2_esp.build.variant=esp32c3
dsdi2_esp.build.board=ESP32C3_DEV
dsdi2_esp.build.bootloader_addr=0x0

dsdi2_esp.build.cdc_on_boot=0
dsdi2_esp.build.f_cpu=160000000L
dsdi2_esp.build.flash_size=4MB
dsdi2_esp.build.flash_freq=80m
dsdi2_esp.build.flash_mode=qio
dsdi2_esp.build.boot=qio
dsdi2_esp.build.partitions=default
dsdi2_esp.build.defines=

dsdi2_esp.menu.CDCOnBoot.default=Disabled
dsdi2_esp.menu.CDCOnBoot.default.build.cdc_on_boot=0
dsdi2_esp.menu.CDCOnBoot.cdc=Enabled
dsdi2_esp.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

dsdi2_esp.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
dsdi2_esp.menu.PartitionScheme.default.build.partitions=default
dsdi2_esp.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
dsdi2_esp.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
dsdi2_esp.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
dsdi2_esp.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
dsdi2_esp.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
dsdi2_esp.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
dsdi2_esp.menu.PartitionScheme.minimal.build.partitions=minimal
dsdi2_esp.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
dsdi2_esp.menu.PartitionScheme.no_ota.build.partitions=no_ota
dsdi2_esp.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
dsdi2_esp.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
dsdi2_esp.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
dsdi2_esp.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
dsdi2_esp.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
dsdi2_esp.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
dsdi2_esp.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
dsdi2_esp.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
dsdi2_esp.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
dsdi2_esp.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
dsdi2_esp.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
dsdi2_esp.menu.PartitionScheme.huge_app.build.partitions=huge_app
dsdi2_esp.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
dsdi2_esp.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
dsdi2_esp.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
dsdi2_esp.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
dsdi2_esp.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
dsdi2_esp.menu.PartitionScheme.fatflash.build.partitions=ffat
dsdi2_esp.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
dsdi2_esp.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
dsdi2_esp.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
dsdi2_esp.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

dsdi2_esp.menu.CPUFreq.160=160MHz (WiFi)
dsdi2_esp.menu.CPUFreq.160.build.f_cpu=160000000L
dsdi2_esp.menu.CPUFreq.80=80MHz (WiFi)
dsdi2_esp.menu.CPUFreq.80.build.f_cpu=80000000L
dsdi2_esp.menu.CPUFreq.40=40MHz
dsdi2_esp.menu.CPUFreq.40.build.f_cpu=40000000L
dsdi2_esp.menu.CPUFreq.20=20MHz
dsdi2_esp.menu.CPUFreq.20.build.f_cpu=20000000L
dsdi2_esp.menu.CPUFreq.10=10MHz
dsdi2_esp.menu.CPUFreq.10.build.f_cpu=10000000L


dsdi2_esp.menu.FlashMode.dio=DIO
dsdi2_esp.menu.FlashMode.dio.build.flash_mode=dio
dsdi2_esp.menu.FlashMode.dio.build.boot=dio


dsdi2_esp.menu.FlashFreq.80=80MHz
dsdi2_esp.menu.FlashFreq.80.build.flash_freq=80m


dsdi2_esp.menu.FlashSize.4M=4MB (32Mb)
dsdi2_esp.menu.FlashSize.4M.build.flash_size=4MB


dsdi2_esp.menu.UploadSpeed.115200=115200
dsdi2_esp.menu.UploadSpeed.115200.upload.speed=115200


dsdi2_esp.menu.DebugLevel.none=None
dsdi2_esp.menu.DebugLevel.none.build.code_debug=0
dsdi2_esp.menu.DebugLevel.error=Error
dsdi2_esp.menu.DebugLevel.error.build.code_debug=1
dsdi2_esp.menu.DebugLevel.warn=Warn
dsdi2_esp.menu.DebugLevel.warn.build.code_debug=2
dsdi2_esp.menu.DebugLevel.info=Info
dsdi2_esp.menu.DebugLevel.info.build.code_debug=3
dsdi2_esp.menu.DebugLevel.debug=Debug
dsdi2_esp.menu.DebugLevel.debug.build.code_debug=4
dsdi2_esp.menu.DebugLevel.verbose=Verbose
dsdi2_esp.menu.DebugLevel.verbose.build.code_debug=5
#DSD-i2-end